<a href="https://colab.research.google.com/github/SamuelSSan28/Back_to_the_Past/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# ***Pandas***

<h4 align="justify">
Além de animaizinhos simpáticos, Pandas também é uma biblioteca Python. Ela fornece ferramentas de análise de dados e estruturas de dados de alta performance e fáceis de usar.
Pela praticidade e funcionalidade que essa ferramenta oferece se tornou uma das minha bibliotecas favoritas, mas também fundamental para Análise de Dados. 
<h4/>

<p align="center">
##  <img width="380" height="180" src ="https://res.cloudinary.com/practicaldev/image/fetch/s--Cdlxz2m5--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://proxy.duckduckgo.com/iu/%3Fu%3Dhttps%253A%252F%252Fmedia.giphy.com%252Fmedia%252FaUhEBE0T8XNHa%252Fgiphy.gif%26f%3D1">
</p>

In [0]:
import pandas as pd

## Criando um dataframe

DataFrame é uma estrutura bidimensional de dados, como uma planilha.

Criando a partir de um dicionario do Python

In [0]:
dicionario = {"A": [1,1,2,3,4,5,6], "B":[4,4,5,6,None,11,12], "C":[7,7,8,9,19,20,21]}

data_frame_dict = pd.DataFrame(data=dicionario)

Criando a partir de um arquivo csv local ou na nuvem

In [0]:
data_frame_csv_local =pd.read_csv('data.csv')

In [0]:
data_frame_csv_nuvem =pd.read_csv('https://raw.githubusercontent.com/SamuelSSan28/Collab_Experimento/master/corrente_dia_16_12_2019.csv')

## As funcionalidades do Pandas que mais necesito no dia a dia

<p align="center">
  <img width="380" height="180" src="https://i.imgur.com/MvMxQ1a.gif"/>
<p/>

In [32]:
# o padrão do método head são as 5 primeiras linhas. Mas pode ser alterado de acordo com a necessidade.
data_frame_dict.head()

   A    B   C
0  1  4.0   7
1  1  4.0   7
2  2  5.0   8
3  3  6.0   9
4  4  NaN  19

Tamanho do Dataframe

In [18]:
data_frame_csv_local.shape
#(Linhas,Colunas)

(35, 5)

Colunas do Dataframe

In [19]:
data_frame_csv_local.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'class'], dtype='object')

Medidas estatisticas  sobre cada coluna do dataframe

In [22]:
data_frame_csv_local.describe()

       sepal_length  sepal_width  petal_length  petal_width
count     35.000000    35.000000     35.000000    35.000000
mean       6.642857     3.002857      5.540000     2.014286
std        0.603561     0.327635      0.553704     0.285062
min        5.600000     2.200000      4.800000     1.400000
25%        6.250000     2.800000      5.100000     1.800000
50%        6.500000     3.000000      5.500000     2.000000
75%        6.900000     3.200000      5.750000     2.300000
max        7.900000     3.800000      6.900000     2.500000

Remover dados duplicados

In [33]:
data_frame_dict.drop_duplicates(inplace=True) #inplace=True
data_frame_dict

   A     B   C
0  1   4.0   7
2  2   5.0   8
3  3   6.0   9
4  4   NaN  19
5  5  11.0  20
6  6  12.0  21

Remover dados vazios

In [35]:
data_frame_dict.dropna(axis=0,inplace=True)
data_frame_dict

   A     B   C
0  1   4.0   7
2  2   5.0   8
3  3   6.0   9
5  5  11.0  20
6  6  12.0  21

In [36]:
data_frame_dict.rename(columns={'A': 'Altura(m)', 'B':'Peso(Toneladas)', 'C':'Largura(cm)'})

   Altura(m)  Peso(Toneladas)  Largura(cm)
0          1              4.0            7
2          2              5.0            8
3          3              6.0            9
5          5             11.0           20
6          6             12.0           21